import numpy as np

v1 = np.array([1,2,3,4])
v2 = np.array([5,6,7,8])

print(f"dot을 활용 한 결과 값 : {np.dot(v1, v2)}")
print(f"@을 활용 한 결과 값 : {v1 @ v2}")

print(f"수동검증 = 1x5 + 2x6 + 3x7 + 4x8 ==> {1*5 + 2*6 + 3*7 + 4*8 }")
print("----------------------------------------------------------------------------")

a = np.array([[1,2,3], [4,5,6]])
b = np.array([[7,8], [9,10], [11,12]])
print("----------------------------------------------------------------------------")

print(f" a행렬과 b행렬의 @를 활용 한 결과 값 : {a @ b}")

print(f"{1*7 + 2 * 9 + 3 * 11} , {1 * 8 + 2 * 10 + 3 * 12}")
print(f"{4*7 + 5 * 9 + 6 * 11} , {4 * 8 + 5 * 10 + 6*12}")
print("----------------------------------------------------------------------------")


c  = np.array([3,4,5])

print(np.linalg.norm(c, 1))   
print(np.linalg.norm(c, 2))
print(np.linalg.norm(c, np.inf))
print("----------------------------------------------------------------------------")

data = np.array([1, 5, 3, 8, 2, 9, 4, 7, 6])

biggerthan_5 = data[data>5]
bet_37 = data[(3 <= data) & (data <= 7)]
even = data[data % 2 == 0]

print(f"5보다 큰수 : {biggerthan_5}" )
print(f"3이상 7이하 : {bet_37}")
print(f"짝수만 출력 :{even}")
print("----------------------------------------------------------------------------")
